app/views/projects/_track_form.html.erb

            <%= f.label :label %>
            <%= f.select :label, options_for_select(["Label 1", "Label 2", "More labels", "Lots of labels"]), {}, { :class => 'form-control'} %>
---
SELECT  "labels".* FROM "labels" WHERE "labels"."track_id" = ? LIMIT 1  [[nil, 10]]