app/views/projects/index.html.erb

SELECT "projects".* FROM "projects"
---
      <tbody>
        <% current_user.projects.each do |project| %>