app/views/projects/show.html.erb

			<dt> Creator </dt>
			<dd><%= User.find(@project.author_id).email %></dd>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]