app/controllers/categories_controller.rb

INSERT INTO "categories" ("name", "color", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "First category"], ["color", 1], ["created_at", "2016-01-24 18:30:38.926324"], ["updated_at", "2016-01-24 18:30:38.926324"]]
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save

UPDATE "categories" SET "color" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["color", 3], ["updated_at", "2016-01-24 20:01:59.137449"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @category.update(category_params)

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 2]]
---
  def set_category
    @category = Category.find Category.decode_id(params[:id])