app/controllers/projects_controller.rb

  def index
    @projects = Project.all#current_user.projects
---
SELECT "projects".* FROM "projects"

  def show
    @tracks = @project.tracks.order(created_at: :desc)
    @track = @tracks.first
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."project_id" = ?  ORDER BY "tracks"."created_at" DESC LIMIT 1  [["project_id", 3]]
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."project_id" = ?  ORDER BY "tracks"."updated_at" DESC LIMIT 1  [["project_id", 3]]

  def start
    @track = Track.new
    @track.start = DateTime.now
    if @track.save
---
INSERT INTO "tracks" ("start", "created_at", "updated_at") VALUES (?, ?, ?)  [["start", "2016-01-29 01:07:21.292750"], ["created_at", "2016-01-29 01:07:21.512436"], ["updated_at", "2016-01-29 01:07:21.512436"]]

  def stop
    @track = @project.tracks.order(:created_at).last
    if @track.update(:end => DateTime.now)
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."project_id" = ?  ORDER BY "tracks"."created_at" DESC LIMIT 1  [["project_id", 3]]
UPDATE "tracks" SET "end" = ?, "updated_at" = ? WHERE "tracks"."id" = ?  [["end", "2016-01-29 01:30:06.033390"], ["updated_at", "2016-01-29 01:30:06.034467"], ["id", 1]]

  def new
    @project = current_user.projects.new
    authorize_action_for @project
    @categories = Category.where(user_id: nil) + current_user.categories
---
SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = ?  [["user_id", 2]]

  def edit
    authorize_action_for @project
    @categories = Category.where(user_id: nil) + current_user.categories
---
SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = ?  [["user_id", 1]]

  def create
    @project = current_user.projects.new(project_params)
    authorize_action_for @project
    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("name", "description", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "t222"], ["description", "t"], ["author_id", 1], ["created_at", "2016-01-30 18:13:50.387236"], ["updated_at", "2016-01-30 18:13:50.387236"]]

  def update
    authorize_action_for @project
    respond_to do |format|
      if @project.update(project_params)
---
UPDATE "projects" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["name", "TESTe"], ["description", "123e"], ["updated_at", "2016-01-30 19:24:45.793767"], ["id", 2]]

  def destroy
    authorize_action_for @project
    @project.destroy
---
DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 1]]

  def delete_track
    Track.find(params[:id]).destroy
---
DELETE FROM "tracks" WHERE "tracks"."id" = ?  [["id", 2]]
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = ? LIMIT 1  [["id", 2]]

    def set_project
      @project = Project.find Project.decode_id(params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 3]]